using System.Collections;
using System.Collections.Generic;
using UnityEngine;

/*
孙子兵法：上兵伐谋、其次伐交、其次伐兵、其次攻城。
孙子兵法：百战百胜，非善之善者也；不战而屈人之兵，善之善者也。
孙子兵法：善用兵者，屈人之兵而非战也，拔人之城而非攻也，毁人之国而非久也，必以全争于天下。

通过一定的方式，实现特定的政治目的，才是统治的核心目标。战争只是其中一种手段。
战斗需要调动全国力量，消耗国库资源，疲乏百姓生产，以供养军事力量。因此，实际用兵战斗，是最后方案。
一切的战争都是无法调节的政治冲突的最后决胜方式。战斗的胜利并不能带来政治的进步，只有在生产、经济、社会、文化等方面协同发展，才能实现政治的进步。
 */

/*
自由空域宏观运营分析

自由空域是一个空陆协同的战争游戏。游戏的玩法是，玩家可以选择不同的阵营，在自由空域中展开基于现代工业化载具的战争对抗。
基于孙子兵法揭示的战争理论，
1.不同的阵营之间要有相互冲突的核心政治目的
2.不同的阵营之间要都有现代工业载具的生产力
人类历史上排除情绪化的理由外，常见的冲突有：
1.生存竞争：资源相对不足，生存必要资源供少于求。
2.生存斗争：资源相对充足，但只要其他人拿的多就会消灭我。
3.侵略斗争：资源相对充足，且我方占优势，为了掠夺更多资源而进行的斗争。
4.革新斗争：资源相对充足，但我方占劣势，要求修改分配规则而进行的斗争。
5.起义斗争：资源相对充足，且我方占劣势，要求彻底打破并重构分配规则。
6.革命斗争：资源相对充足，但分配方式不合理、巨大浪费。为了优化资源分配模式而进行的斗争。

在战争雷霆中，运营给玩家搭建了一个战斗平台，让玩家之间相互对抗。
玩家在对战争载具的操控、战斗信息的收集、战斗策略的设计，以及和其他玩家的对抗和交流中获得成长、乐趣。
自由空域只有和战争雷霆进行差异化竞争才能够吸引玩家。

目前战争雷霆可见的一个缺点是，玩家无法和队友进行有效的实时沟通。
我可以通过引入更高效的沟通方式来解决这个问题。
语音交流，即时无线电，快速标点等方式提高玩家之间的沟通效率。
 */

/*
只有持续的吸引玩家，留存玩家，才能实现自由空域的持续发展。
我该如何做到吸引、留存？
差异化实现吸引，体验实现留存。
差异：玩法细节、更新速度、交流效率。
体验：特效，细节，音效。
 */
